#!/usr/bin/env python3
"""
Скрипт для поиска и обновления задачи MAR-24 в Linear
Добавляет информацию о сценарии активации первого клиента партнёра
"""

import os
import requests
from typing import Optional, Dict
from dotenv import load_dotenv

load_dotenv()

LINEAR_API_URL = "https://api.linear.app/graphql"


def find_issue_by_title(title_keywords: list, team_key: Optional[str] = None) -> Optional[Dict]:
    """
    Найти задачу по ключевым словам в названии
    
    Args:
        title_keywords: Список ключевых слов для поиска
        team_key: Ключ команды (например, "MAR")
    
    Returns:
        Dict с информацией о найденной задаче или None
    """
    api_key = os.getenv("LINEAR_API_KEY")
    
    if not api_key:
        print("❌ LINEAR_API_KEY не найден в переменных окружения")
        return None
    
    headers = {
        "Authorization": api_key,
        "Content-Type": "application/json"
    }
    
    # Получаем team_id если указан team_key
    team_id = None
    if team_key:
        query = """
        query {
            teams {
                nodes {
                    id
                    key
                }
            }
        }
        """
        try:
            response = requests.post(
                LINEAR_API_URL,
                headers=headers,
                json={"query": query}
            )
            if response.status_code == 200:
                data = response.json()
                if "errors" not in data:
                    for team in data["data"]["teams"]["nodes"]:
                        if team["key"] == team_key:
                            team_id = team["id"]
                            break
        except Exception as e:
            print(f"❌ Ошибка при получении команды: {e}")
            return None
    
    # Ищем задачи
    query = """
    query($filter: IssueFilter) {
        issues(filter: $filter) {
            nodes {
                id
                identifier
                title
                description
                url
                team {
                    key
                    name
                }
            }
        }
    }
    """
    
    # Формируем фильтр
    filter_data = {}
    if team_id:
        filter_data["team"] = {"id": {"eq": team_id}}
    
    variables = {"filter": filter_data}
    
    try:
        response = requests.post(
            LINEAR_API_URL,
            headers=headers,
            json={"query": query, "variables": variables}
        )
        
        if response.status_code != 200:
            print(f"❌ Ошибка HTTP: {response.status_code}")
            return None
        
        data = response.json()
        
        if "errors" in data:
            print(f"❌ Ошибка GraphQL: {data['errors']}")
            return None
        
        # Ищем задачу по ключевым словам
        issues = data["data"]["issues"]["nodes"]
        for issue in issues:
            title_lower = issue["title"].lower()
            for keyword in title_keywords:
                if keyword.lower() in title_lower:
                    return {
                        "id": issue["id"],
                        "identifier": issue["identifier"],
                        "title": issue["title"],
                        "description": issue["description"] or "",
                        "url": issue["url"],
                        "team": issue["team"]["key"]
                    }
        
        return None
        
    except Exception as e:
        print(f"❌ Ошибка при поиске задачи: {e}")
        return None


def update_issue_description(issue_id: str, new_description: str) -> Dict:
    """
    Обновить описание задачи в Linear
    
    Args:
        issue_id: ID задачи
        new_description: Новое описание
    
    Returns:
        Dict с результатом операции
    """
    api_key = os.getenv("LINEAR_API_KEY")
    
    if not api_key:
        return {
            "success": False,
            "error": "LINEAR_API_KEY не найден в переменных окружения"
        }
    
    headers = {
        "Authorization": api_key,
        "Content-Type": "application/json"
    }
    
    mutation = """
    mutation($id: String!, $input: IssueUpdateInput!) {
        issueUpdate(id: $id, input: $input) {
            success
            issue {
                id
                identifier
                title
                description
                url
            }
        }
    }
    """
    
    variables = {
        "id": issue_id,
        "input": {
            "description": new_description
        }
    }
    
    try:
        response = requests.post(
            LINEAR_API_URL,
            headers=headers,
            json={"query": mutation, "variables": variables}
        )
        
        if response.status_code != 200:
            return {
                "success": False,
                "error": f"Ошибка HTTP: {response.status_code} - {response.text}"
            }
        
        data = response.json()
        
        if "errors" in data:
            error_messages = [err.get("message", str(err)) for err in data["errors"]]
            return {
                "success": False,
                "error": "; ".join(error_messages)
            }
        
        if not data["data"]["issueUpdate"]["success"]:
            return {
                "success": False,
                "error": "Не удалось обновить задачу (success=false)"
            }
        
        issue = data["data"]["issueUpdate"]["issue"]
        
        return {
            "success": True,
            "issue_id": issue["id"],
            "identifier": issue["identifier"],
            "title": issue["title"],
            "url": issue["url"]
        }
        
    except Exception as e:
        return {
            "success": False,
            "error": f"Ошибка при обновлении задачи: {e}"
        }


def create_mar24_task(description: str) -> Dict:
    """
    Создать задачу MAR-24 если она не найдена
    """
    from linear_task_creator import create_linear_task
    
    return create_linear_task(
        title="MAR-24 · Сценарий активации (первый клиент партнёра)",
        description=description,
        team_key="MAR",
        priority=2  # High priority
    )


def main():
    """Главная функция"""
    print("🔍 Поиск задачи MAR-24 в Linear...\n")
    
    # Ищем задачу по ключевым словам
    keywords = ["MAR-24", "Сценарий активации", "первый клиент партнёра"]
    issue = find_issue_by_title(keywords, team_key="MAR")
    
    # Описание из документа
    description = """# MAR-24 · Сценарий активации (первый клиент партнёра)

## Обзор процесса

**ЦЕЛЬ:** Партнёр получает первого активного клиента  
**ВРЕМЯ:** 1-3 дня от регистрации партнёра  
**КРИТЕРИЙ УСПЕХА:** Клиент совершил первую транзакцию

## Этап 1: Регистрация партнёра (День 0)

### Шаг 1.1: Подача заявки
- Партнёр переходит по ссылке: https://tma-bot-rewards.lovable.app/partner-apply
- Заполняет форму (имя, телефон, название компании, город и т.д.)
- Система создаёт запись в partner_applications со статусом Pending

### Шаг 1.2: Модерация заявки
- Админ получает уведомление в админ-боте
- Проверяет данные и принимает решение: Approve / Reject
- При одобрении создаётся запись в таблице partners

## Этап 2: Онбординг партнёра (День 0-1)

### Шаг 2.1: Первый вход в партнёрский бот
- Партнёр открывает бота @mindbeatybot
- Видит главное меню с разделами: Операции, Контент, Аналитика, Revenue Share, Пригласить клиента

### Шаг 2.2: Обучение партнёра
- Автоматическая отправка приветственного сообщения
- Ссылка на видео-туториал и документацию
- Объяснение ключевых функций: начисление баллов, создание акций, приглашение клиентов

## Этап 3: Приглашение первого клиента (День 1)

### Шаг 3.1: Партнёр получает реферальную ссылку
- Нажимает "👥 Пригласить клиента"
- Получает ссылку: `https://t.me/mindbeatybot?start=partner_{chat_id}`

### Шаг 3.2: Партнёр отправляет ссылку клиенту
- Отправляет ссылку в личные сообщения или показывает QR-код
- Объясняет преимущества программы лояльности

## Этап 4: Регистрация клиента (День 1)

### Шаг 4.1: Клиент переходит по ссылке
- Нажимает на ссылку в Telegram
- Открывается клиентский бот @mindbeatybot
- Выполняется команда: `/start partner_{chat_id}`

### Шаг 4.2: Автоматическая регистрация
- Система проверяет существование клиента
- Создаётся запись в таблице users с балансом 100 баллов (приветственный бонус)
- Создаётся транзакция типа 'enrollment_bonus'
- Клиент получает приветственное сообщение

### Шаг 4.3: Уведомление партнёра
- Партнёр получает сообщение о регистрации нового клиента
- Видит информацию о клиенте и его балансе

## Этап 5: Первая транзакция (День 1-3)

### Шаг 5.1: Клиент приходит в заведение
- Клиент показывает QR-код или партнёр ищет по телефону
- Клиент делает покупку

### Шаг 5.2: Начисление баллов за покупку
- Партнёр нажимает "💰 Операции" → "Начислить баллы"
- Вводит сумму чека
- Система рассчитывает 5% кэшбэк и начисляет баллы
- Клиент и партнёр получают уведомления

### Шаг 5.3: Критерий успеха
✅ АКТИВАЦИЯ ЗАВЕРШЕНА!
- Партнёр зарегистрирован
- Первый клиент приглашён
- Клиент зарегистрирован
- Первая транзакция совершена
- Клиент активен

## Этап 6: Последующие действия (День 3+)

### Шаг 6.1: Мотивация клиента
- Создание акций в разделе "📝 Контент"
- Персональные предложения
- Использование NPS для улучшения сервиса

### Шаг 6.2: Отслеживание прогресса
- Партнёр видит статистику в разделе "📊 Аналитика"
- Количество клиентов, оборот, средний чек, NPS

## Чек-лист для партнёра

✅ РЕГИСТРАЦИЯ:
- [ ] Подана заявка на партнёрство
- [ ] Заявка одобрена админом
- [ ] Получен доступ к партнёрскому боту
- [ ] Просмотрен обучающий материал

✅ ПЕРВЫЙ КЛИЕНТ:
- [ ] Получена реферальная ссылка
- [ ] Ссылка отправлена клиенту
- [ ] Клиент зарегистрирован
- [ ] Клиент получил приветственный бонус (100 баллов)
- [ ] Клиент совершил первую покупку

✅ АКТИВАЦИЯ:
- [ ] Первая транзакция начислена
- [ ] Клиент получил уведомление о баллах
- [ ] Партнёр видит клиента в статистике
- [ ] Сценарий активации завершён

## Метрики успешной активации

**Время активации:**
- Идеально: < 24 часа от регистрации партнёра
- Хорошо: 1-3 дня
- Требует внимания: > 3 дней

**Конверсия:**
- Партнёры, получившие первого клиента: > 80%
- Клиенты, совершившие первую покупку: > 70%
- Повторные визиты в первый месяц: > 40%

**Экономика:**
- Средний чек первого клиента: $30-100
- Кэшбэк: 5% = $1.50-5.00
- LTV клиента (прогноз): $200-500

## Типичные проблемы и решения

**ПРОБЛЕМА 1: Клиент не переходит по ссылке**
- Партнёр должен объяснить преимущества
- Показать примеры использования баллов
- Предложить помощь с регистрацией
- Использовать QR-код для офлайн-регистрации

**ПРОБЛЕМА 2: Клиент зарегистрирован, но не приходит**
- Отправить напоминание через 2-3 дня
- Создать специальную акцию для первого визита
- Предложить бонус за первую покупку
- Использовать push-уведомления

**ПРОБЛЕМА 3: Технические проблемы при начислении баллов**
- Проверить подключение к интернету
- Убедиться, что клиент найден в системе
- Проверить баланс клиента
- Обратиться в поддержку через бот

## Автоматизация процесса (будущие улучшения)

1. **Автоматические напоминания:**
   - Партнёру: "Пригласите первого клиента" (через 24 часа)
   - Клиенту: "Совершите первую покупку" (через 48 часов)
   - Партнёру: "Проверьте статистику" (через 7 дней)

2. **Геймификация:**
   - Бейджи для партнёров: "Первый клиент", "10 клиентов", "100 клиентов"
   - Рейтинг партнёров по скорости активации
   - Награды за быструю активацию

3. **Аналитика:**
   - Dashboard с метриками активации
   - Прогноз времени до первого клиента
   - Рекомендации по улучшению конверсии

---

**Источник:** INDUSTRY_ADAPTATION_ANALYSIS.md, раздел 11
"""
    
    if issue:
        print(f"✅ Задача найдена: {issue['identifier']} - {issue['title']}")
        print(f"   URL: {issue['url']}\n")
        
        # Обновляем описание
        print("📝 Обновление описания задачи...")
        result = update_issue_description(issue['id'], description)
        
        if result["success"]:
            print(f"✅ Описание успешно обновлено!")
            print(f"   Задача: {result['identifier']}")
            print(f"   URL: {result['url']}")
        else:
            print(f"❌ Ошибка при обновлении: {result['error']}")
    else:
        print("❌ Задача не найдена. Создаём новую задачу...\n")
        
        result = create_mar24_task(description)
        
        if result["success"]:
            print(f"✅ Задача успешно создана!")
            print(f"   ID: {result['identifier']}")
            print(f"   Название: {result['title']}")
            print(f"   URL: {result['url']}")
        else:
            print(f"❌ Ошибка при создании: {result['error']}")


if __name__ == "__main__":
    main()

